In [139]:
import psycopg2 as pg
import pandas as pd
import numpy as np
from sqlalchemy import create_engine


Задания:
1) Есть пользователи (id, имя), которые ставят друг другу лайки. Сделать таблицы для хранения всей этой информации.
1. Написать запрос, который выведет такую таблицу:
         • id пользователя
         • имя
         • лайков получено
         • лайков поставлено
         • взаимных лайков
2. Написать запрос, который посчитает 5 самых популярных пользователей

---

2) В воображаемой социальной сети есть Пользователи (id, имя), Фото (id, название, автор) и Комментарии К Фото (id, текст, автор, к какому Фото относится). Необходимо добавить возможность для Пользователей ставить лайки другим Пользователям, Фото или Комментариям к Фото. 

---

### Создание бд:

In [3]:
db = pg.connect(
        user = 'postgres',
        password = 'X7pl2',
        host = 'localhost',
        port = '5432')


def execute_queries(db, sql_commands):
    db.autocommit = True
    
    with db.cursor() as cursor:
        for sql_command in sql_commands:
            print(sql_command)
            cursor.execute(sql_command)
       
    
sql_commands = ["DROP DATABASE IF EXISTS sql_mainor_hw;",
                "CREATE DATABASE sql_mainor_hw;",
                "DROP USER IF EXISTS hw_check;",
                "CREATE USER hw_check with encrypted password 'X7pl2';",
                "ALTER USER hw_check WITH SUPERUSER;"]

execute_queries(db, sql_commands)

DROP DATABASE IF EXISTS sql_mainor_hw;
CREATE DATABASE sql_mainor_hw;
DROP USER IF EXISTS hw_check;
CREATE USER hw_check with encrypted password 'X7pl2';
ALTER USER hw_check WITH SUPERUSER;

#### Создание таблиц:

Я буду делать немного иначе, чем на семинарах, более подробно можно почитать/посмотреть тут:

1) https://towardsdatascience.com/jupyter-magics-with-sql-921370099589 <br>
2) https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html <br>
3) https://www.youtube.com/watch?v=CTOpojJPn9M&list=PLAxJ4-o7ZoPcvp0ETujkLVCmKIGj-YvlG&index=6

In [4]:
%load_ext sql

In [5]:
host = 'localhost'
database = 'sql_mainor_hw'
user = 'hw_check'
password = 'X7pl2'

connection_string = f'postgresql://{user}:{password}@{host}/{database}'

In [6]:
%sql $connection_string

#### Первое задание:

In [66]:

%%sql 

drop table if exists users; 
drop table if exists likes;

create table users (
            user_id int not null,
            name varchar(30) not null,
            created timestamp not null
                    ); 

create table likes (
            user_id int not null,
            liked_id int not null,
            created timestamp not null
                    );

 * postgresql://hw_check:***@localhost/sql_mainor_hw
Done.
Done.
Done.
Done.

[]

In [67]:
%%sql

insert into users(user_id, name, created) values
                                (1, 'Андрей', '2022-11-20'),
                                (2, 'Денис', '2022-11-21'),
                                (3, 'Анастасия', '2022-11-21'),
                                (4, 'Александр', '2022-11-22'),
                                (5, 'Дмитрий', '2022-11-23'),
                                (6, 'Роберт', '2022-11-22'),
                                (7, 'Глеб', '2022-11-22'),
                                (8, 'Даниил', '2022-11-22'),
                                (9, 'Витя', '2022-11-22'),
                                (10, 'Ксения', '2022-11-22');

                    
insert into likes(user_id, liked_id, created) values
                                (1, 2, '2022-11-20'),
                                (1, 3, '2022-11-20'),
                                (1, 4, '2022-11-20'),
                                (2, 5, '2022-11-20'),
                                (2, 4, '2022-11-20'),
                                (3, 2, '2022-11-20'),
                                (3, 2, '2022-11-20'),
                                (4, 1, '2022-11-20'),
                                (5, 1, '2022-11-20'),
                                (5, 3, '2022-11-20'),
                                (6, 3, '2022-11-20'),
                                (6, 4, '2022-11-20'),
                                (6, 5, '2022-11-20'),
                                (7, 1, '2022-11-20'),
                                (7, 1, '2022-11-20'),
                                (8, 3, '2022-11-20'),
                                (9, 5, '2022-11-20'),
                                (10, 6, '2022-11-20'),
                                (10, 7, '2022-11-20'),
                                (10, 8, '2022-11-20'),
                                (10, 9, '2022-11-20'),
                                (10, 10, '2022-11-20'),
                                (10, 10, '2022-11-20'),
                                (10, 4, '2022-11-20'),
                                (10, 3, '2022-11-20');

 * postgresql://hw_check:***@localhost/sql_mainor_hw
10 rows affected.
25 rows affected.

[]

In [58]:
%%sql

select * from users;

 * postgresql://hw_check:***@localhost/sql_mainor_hw
10 rows affected.

[(1, 'Андрей', datetime.datetime(2022, 11, 20, 0, 0)),
 (2, 'Денис', datetime.datetime(2022, 11, 21, 0, 0)),
 (3, 'Анастасия', datetime.datetime(2022, 11, 21, 0, 0)),
 (4, 'Александр', datetime.datetime(2022, 11, 22, 0, 0)),
 (5, 'Дмитрий', datetime.datetime(2022, 11, 23, 0, 0)),
 (6, 'Александр', datetime.datetime(2022, 11, 22, 0, 0)),
 (7, 'Глеб', datetime.datetime(2022, 11, 22, 0, 0)),
 (8, 'Даниил', datetime.datetime(2022, 11, 22, 0, 0)),
 (9, 'Витя', datetime.datetime(2022, 11, 22, 0, 0)),
 (10, 'Ксения', datetime.datetime(2022, 11, 22, 0, 0))]

In [59]:
%%sql

select * from likes;

 * postgresql://hw_check:***@localhost/sql_mainor_hw
25 rows affected.

[(1, 2, datetime.datetime(2022, 11, 20, 0, 0)),
 (1, 3, datetime.datetime(2022, 11, 20, 0, 0)),
 (1, 4, datetime.datetime(2022, 11, 20, 0, 0)),
 (2, 5, datetime.datetime(2022, 11, 20, 0, 0)),
 (2, 4, datetime.datetime(2022, 11, 20, 0, 0)),
 (3, 2, datetime.datetime(2022, 11, 20, 0, 0)),
 (3, 2, datetime.datetime(2022, 11, 20, 0, 0)),
 (4, 1, datetime.datetime(2022, 11, 20, 0, 0)),
 (5, 1, datetime.datetime(2022, 11, 20, 0, 0)),
 (5, 3, datetime.datetime(2022, 11, 20, 0, 0)),
 (6, 3, datetime.datetime(2022, 11, 20, 0, 0)),
 (6, 3, datetime.datetime(2022, 11, 20, 0, 0)),
 (6, 4, datetime.datetime(2022, 11, 20, 0, 0)),
 (7, 1, datetime.datetime(2022, 11, 20, 0, 0)),
 (7, 1, datetime.datetime(2022, 11, 20, 0, 0)),
 (8, 3, datetime.datetime(2022, 11, 20, 0, 0)),
 (9, 5, datetime.datetime(2022, 11, 20, 0, 0)),
 (10, 6, datetime.datetime(2022, 11, 20, 0, 0)),
 (10, 7, datetime.datetime(2022, 11, 20, 0, 0)),
 (10, 8, datetime.datetime(2022, 11, 20, 0, 0)),
 (10, 9, datetime.datetime(2022, 11, 20, 0, 0)),
 (10, 10, datetime.datetime(2022, 11, 20, 0, 0)),
 (10, 10, datetime.datetime(2022, 11, 20, 0, 0)),
 (10, 4, datetime.datetime(2022, 11, 20, 0, 0)),
 (10, 3, datetime.datetime(2022, 11, 20, 0, 0))]

---

Напишем запрос, который выведет такую таблицу:

      • id пользователя
      • имя
      • лайков получено
      • лайков поставлено

In [110]:
%%sql

select t1.user_id, t1.name as Имя, t1.likes_got as Лайков_получено, t2.likes_put as Лайков_поставлено
from  
    (
        (
            select u.user_id as user_id, u.name as name, count(*) as likes_got
            from likes l, users u 
            where l.liked_id = u.user_id
            group by u.user_id, u.name
        )t1

            inner join

        (
            select l.user_id as user_id, count(*) as likes_put
            from likes l
            group by l.user_id
        )t2

            on t1.user_id = t2.user_id
    
    )
    
order by 1;

 * postgresql://hw_check:***@localhost/sql_mainor_hw
10 rows affected.

[(1, 'Андрей', 4, 3),
 (2, 'Денис', 3, 2),
 (3, 'Анастасия', 5, 2),
 (4, 'Александр', 4, 1),
 (5, 'Дмитрий', 3, 2),
 (6, 'Роберт', 1, 3),
 (7, 'Глеб', 1, 2),
 (8, 'Даниил', 1, 1),
 (9, 'Витя', 1, 1),
 (10, 'Ксения', 2, 8)]

Найдем 5 самых популярных пользователей:

In [111]:
%%sql

select u.name, count(*)
from likes l, users u
where l.liked_id = u.user_id
group by u.name
order by 2 DESC
limit 5;

 * postgresql://hw_check:***@localhost/sql_mainor_hw
5 rows affected.

[('Анастасия', 5),
 ('Александр', 4),
 ('Андрей', 4),
 ('Денис', 3),
 ('Дмитрий', 3)]

---

#### Второе задание:

In [134]:
%%sql

drop table if exists Users;
drop table if exists Photos;
drop table if exists Comments;
drop table if exists Likes;



create table Users (
            user_id int not null,
            name varchar(30) not null
                    ); 


create table Photos (
            photo_id int not null,
            photo_name varchar(30) not null,
            photo_author varchar(30) not null
                    );


create table Comments (
            comment_id int not null,
            text varchar(50) not null,
            comment_author varchar(30) not null,
            photo_id int not null
                       );


create table Likes (
            user_id int,
            to_user int,
            to_photo int,
            to_comment int  
                    );

 * postgresql://hw_check:***@localhost/sql_mainor_hw
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [135]:
%%sql

insert into Users (user_id, name) values
                                        (1, 'Александр'),
                                        (2, 'Владимир'),
                                        (3, 'Дмитрий'),
                                        (4, 'Павел'),
                                        (5, 'Алексей'),
                                        (6, 'Андрей');
                        

insert into Photos (photo_id, photo_name, photo_author) values
                                        (1, 'AA', 'Владимир'),
                                        (2, 'BB', 'Владимир'),
                                        (3, 'CC', 'Александр'),
                                        (4, 'DD', 'Андрей'),
                                        (5, 'EE', 'Андрей'),
                                        (6, 'FF', 'Павел');                        
   

insert into Comments (comment_id, text, comment_author, photo_id) values
                                        (1, 'texttexttext', 'Павел', 2),
                                        (2, 'texttext', 'Павел', 3),
                                        (3, 'text', 'Андрей', 3),
                                        (4, 'texttexttexttext', 'Владимир', 6);

                        
insert into Likes (user_id, to_user, to_photo, to_comment) values
                                        (1, null, 2, null),
                                        (1, null, 3, null),
                                        (1, null, null, 3),
                                        (2, null, 3, null),
                                        (3, 2, null, null),
                                        (4, 1, null, null),
                                        (4, 1, null, null),
                                        (5, 4, null, null),
                                        (5, 6, null, null),
                                        (6, 5, null, null);

 * postgresql://hw_check:***@localhost/sql_mainor_hw
6 rows affected.
6 rows affected.
4 rows affected.
10 rows affected.

[]

In [136]:
%%sql

select u.name as Имя, count(*) as Лайков_у_пользователя
from Users u, Likes l
where l.to_user = u.user_id
group by u.name;

 * postgresql://hw_check:***@localhost/sql_mainor_hw
5 rows affected.

[('Александр', 2),
 ('Владимир', 1),
 ('Павел', 1),
 ('Андрей', 1),
 ('Алексей', 1)]

In [137]:
%%sql

select p.photo_id as Фото_id, count(*) as Лайков_на_фото
from Photos p, Likes l
where l.to_photo = p.photo_id
group by p.photo_id;

 * postgresql://hw_check:***@localhost/sql_mainor_hw
2 rows affected.

[(3, 2), (2, 1)]

Предположим, что пользователь с id = 5 отозвал один лайк с пользователя с id = 4. <br>
Реализуем ситуацию, что пользователь может отозвать лайк:

In [138]:
%%sql

update Likes l
set to_user = null
where to_user = 4 and user_id = 5;

select * from Likes;

 * postgresql://hw_check:***@localhost/sql_mainor_hw
1 rows affected.
10 rows affected.

[(1, None, 2, None),
 (1, None, 3, None),
 (1, None, None, 3),
 (2, None, 3, None),
 (3, 2, None, None),
 (4, 1, None, None),
 (4, 1, None, None),
 (5, 6, None, None),
 (6, 5, None, None),
 (5, None, None, None)]

---